; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l4_p4_c4_g4_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(crate-content crate1 food)
	(crate-content crate2 medicine)
	(crate-content crate3 medicine)
	(crate-content crate4 medicine)
	(at person1 loc2)
	(at person2 loc4)
	(at person3 loc4)
	(at person4 loc1)
	(person-needs person1 medicine)
	(person-needs person2 medicine)
	(person-needs person3 medicine)
	(person-needs person4 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 medicine)
	(person-has person2 medicine)
	(person-has person3 medicine)
	(person-has person4 food)
	))
)

; plan
1. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 1 of 5
2. (grab-arm1 drone1 crate4 depot)
   deleted: (arm1-free drone1) (at crate4 depot)
   added: (arm1-load drone1 crate4)
   goals met: 1 of 5
3. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 0 of 5
4. (deliver-arm2 drone1 person4 crate1 food loc1)
   deleted: (arm2-load drone1 crate1) (person-needs person4 food)
   added: (arm2-free drone1) (person-has person4 food)
   goals met: 1 of 5
5. (move-drone drone1 loc1 loc4)
   deleted: (at drone1 loc1)
   added: (at drone1 loc4)
   goals met: 1 of 5
6. (deliver-arm1 drone1 person2 crate4 medicine loc4)
   deleted: (arm1-load drone1 crate4) (person-needs person2 medicine)
   added: (arm1-free drone1) (person-has person2 medicine)
   goals met: 2 of 5
7. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 3 of 5
8. (grab-arm1 drone1 crate2 depot)
   deleted: (arm1-free drone1) (at crate2 depot)
   added: (arm1-load drone1 crate2)
   goals met: 3 of 5
9. (move-drone drone1 depot loc4)
   deleted: (at drone1 depot)
   added: (at drone1 loc4)
   goals met: 2 of 5
10. (deliver-arm1 drone1 person3 crate2 medicine loc4)
   deleted: (arm1-load drone1 crate2) (person-needs person3 medicine)
   added: (arm1-free drone1) (person-has person3 medicine)
   goals met: 3 of 5
11. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 4 of 5
12. (grab-arm1 drone1 crate3 depot)
   deleted: (arm1-free drone1) (at crate3 depot)
   added: (arm1-load drone1 crate3)
   goals met: 4 of 5
13. (move-drone drone1 depot loc2)
   deleted: (at drone1 depot)
   added: (at drone1 loc2)
   goals met: 3 of 5
14. (deliver-arm1 drone1 person1 crate3 medicine loc2)
   deleted: (arm1-load drone1 crate3) (person-needs person1 medicine)
   added: (arm1-free drone1) (person-has person1 medicine)
   goals met: 4 of 5
15. (move-drone drone1 loc2 depot)
   deleted: (at drone1 loc2)
   added: (at drone1 depot)
   goals met: 5 of 5
